In [1]:
import pandas as pd
import numpy as np

# s1 = pd.Series([1,2,3,4,5])
s1 = pd.Series([1,2,1,2,5], index=['a','b','c','d','e'])
s1
print(s1)
print(s1.index)
print(s1.values)
# series의 index 바꾸기
s1.index=['가','나','다','라','마']
s1
print(s1.value_counts)

a    1
b    2
c    1
d    2
e    5
dtype: int64
Index(['a', 'b', 'c', 'd', 'e'], dtype='object')
[1 2 1 2 5]
<bound method IndexOpsMixin.value_counts of 가    1
나    2
다    1
라    2
마    5
dtype: int64>

In [2]:
s2 = pd.Series({'a':1, 'b':2, 'c':3})
s2
print(s2)
s3 = pd.Series(np.array([1,2,3,4,5]))
print(s3)

a    1
b    2
c    3
dtype: int64
0    1
1    2
2    3
3    4
4    5
dtype: int32

In [3]:
df = pd.DataFrame({'a':[10,20,30], 'b':[20,30,40], 'c':[31,32,33]})
print(df)
print(df.columns)
print(df.index)
print(df.shape)

    a   b   c
0  10  20  31
1  20  30  32
2  30  40  33
Index(['a', 'b', 'c'], dtype='object')
RangeIndex(start=0, stop=3, step=1)
(3, 3)

In [4]:
names = ['kim', 'park', 'choi', 'lee']
ages = [20, 22, 21,22]
genders = ['M', 'M', 'F', 'M']
data = {'names':names, 'ages':ages, 'genders':genders}
df1 = pd.DataFrame(data)
df1

  names  ages genders
0   kim    20       M
1  park    22       M
2  choi    21       F
3   lee    22       M

In [5]:
data = [names, ages, genders]
# pd.DataFrame(data).T : T <- 데이터 프레임의 행과 열을 바꾼다.
df2 = pd.DataFrame(data).T
df2.columns = ['name', 'age', 'genders']
df2.index = ['one', 'teo', 'three','fore']
df2

       name age genders
one     kim  20       M
teo    park  22       M
three  choi  21       F
fore    lee  22       M

In [6]:
names = ['kim', 'lee', 'choi', 'park', 'hong']
year = [2013, 2014, 2013, 2015, 2014]
points = [1.5, 1.7, 3.6, 2.4, 2.9]
data = [names, year, points]

df = pd.DataFrame(data).T
df.columns = ['name', 'year', 'point']
df.index=['one', 'two', 'three', 'fore', 'five']
print(df)
print(df.info())

       name  year point
one     kim  2013   1.5
two     lee  2014   1.7
three  choi  2013   3.6
fore   park  2015   2.4
five   hong  2014   2.9
<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, one to five
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   year    5 non-null      object
 2   point   5 non-null      object
dtypes: object(3)
memory usage: 160.0+ bytes
None

In [7]:
# 필드를 가지고 오기
print(df.year)
print(df['year'])

one      2013
two      2014
three    2013
fore     2015
five     2014
Name: year, dtype: object
one      2013
two      2014
three    2013
fore     2015
five     2014
Name: year, dtype: object

In [8]:
# 오브젝트를 숫자로 : 컬럼의 데이터 타입을 바꾸는 방법
df['year'] = df['year'].astype('int64')
df['point'] = df['point'].astype('float32')
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, one to five
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   year    5 non-null      int64
 2   point   5 non-null      float32
dtypes: float32(1), int64(1), object(1)
memory usage: 140.0+ bytes

In [9]:
df['point2'] = df['point'] + 0.5
print(df)

       name  year  point  point2
one     kim  2013    1.5     2.0
two     lee  2014    1.7     2.2
three  choi  2013    3.6     4.1
fore   park  2015    2.4     2.9
five   hong  2014    2.9     3.4

In [10]:
print(df.name)
print(df['name'])
# 데이터 프레임에 접근 방법
df.values
df.index

one       kim
two       lee
three    choi
fore     park
five     hong
Name: name, dtype: object
one       kim
two       lee
three    choi
fore     park
five     hong
Name: name, dtype: object

Index(['one', 'two', 'three', 'fore', 'five'], dtype='object')

In [11]:
for i in df.values :
    print(i[0])

kim
lee
choi
park
hong

In [12]:
# 새로운 컬럼 'aa'에 기존의 값을 연산을 해서 넣기
df['aa'] = df.point * 0.5
df['bb'] = 1
df['cc'] = [1,2,3,4,5]
print(df)

       name  year  point  point2    aa  bb  cc
one     kim  2013    1.5     2.0  0.75   1   1
two     lee  2014    1.7     2.2  0.85   1   2
three  choi  2013    3.6     4.1  1.80   1   3
fore   park  2015    2.4     2.9  1.20   1   4
five   hong  2014    2.9     3.4  1.45   1   5

In [13]:
df['aa']
df[['aa', 'bb']]
# 행을 가지고 오는 방법
df.loc['one'] # one행의 데이터만 가지고 오는 방법
df.loc[{'one', 'fore'}]
df.loc['one' : 'two'] #one 에서 two까지 가지고 오기
df.loc['one' : 'fore', ['name', 'point']] # one ~ fore 행중에 name과 point의 값만 가지고 옴

C:\Users\yang\AppData\Local\Temp\ipykernel_12524\805786078.py:5: FutureWarning: Passing a set as an indexer is deprecated and will raise in a future version. Use a list instead.
  df.loc[{'one', 'fore'}]

       name  point
one     kim    1.5
two     lee    1.7
three  choi    3.6
fore   park    2.4

In [14]:
# 문자 인덱스를 숫자로 사용 : iloc
df.iloc[1:3, 0]
df.iloc[1:3, [0, 2]]

       name  point
two     lee    1.7
three  choi    3.6

In [15]:
df.loc[df['point']>2.5, :]

       name  year  point  point2    aa  bb  cc
three  choi  2013    3.6     4.1  1.80   1   3
five   hong  2014    2.9     3.4  1.45   1   5

In [16]:
# 삭제
df.drop('bb', axis=1) # 칼럼 삭제
df.drop('one', axis=0) # rows 삭제
# 지금의 상태는 데이터 프레임에는 남아 있다
df1 = df.drop('bb', axis=1)  # 새로 받으면 데이터 프레임의 내용이 삭제 되는게 적용이 됨

In [17]:
kors = [80, 75, 60, 70, 95]
engs = [86, 70, 65, 75, 90]
maths = [80, 75, 70, 65, 85]
data = {'name':names, 'kor' : kors , 'eng' : engs, 'math' : maths}
df1 = pd.DataFrame(data, index=['a','b','c','d','f'])
df1

   name  kor  eng  math
a   kim   80   86    80
b   lee   75   70    75
c  choi   60   65    70
d  park   70   75    65
f  hong   95   90    85

In [18]:
# class 필드를 값 = ['A', 'B', 'A', 'B', 'C]로 삽입하라
# total 필드 = kor + eng + math 값으로 필드를 삽입
# avg 필드 : 학생당 국어, 영어, 수학 성적의 평균을 구하하
# 평균이  80점 이상인 사람을 검색하라 
#

In [19]:
df1['class'] = ['A', 'B', 'A', 'B', 'C']
df1['total'] = df1.kor + df1.eng + df1.math
df1['avg'] = df1.total/3
print(df1)
df1.loc[(df1['avg']>80) & (df1.kor>=85), :] # AND
# df1.loc[(df1['avg']>80) | (df1.kor>=85), :] # OR

   name  kor  eng  math class  total        avg
a   kim   80   86    80     A    246  82.000000
b   lee   75   70    75     B    220  73.333333
c  choi   60   65    70     A    195  65.000000
d  park   70   75    65     B    210  70.000000
f  hong   95   90    85     C    270  90.000000

   name  kor  eng  math class  total   avg
f  hong   95   90    85     C    270  90.0

In [20]:
df1.groupby('class') # class별로 그룹
df1.groupby('class').mean()
df1.groupby('class')['total', 'avg'].mean()
# agg : 필드별 연산
df1.groupby('class').agg({'total' : 'sum', 'avg': 'mean'})

C:\Users\yang\AppData\Local\Temp\ipykernel_12524\2424476559.py:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df1.groupby('class').mean()
C:\Users\yang\AppData\Local\Temp\ipykernel_12524\2424476559.py:3: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  df1.groupby('class')['total', 'avg'].mean()

       total        avg
class
A        441  73.500000
B        430  71.666667
C        270  90.000000

In [21]:
df1.describe() # 숫자값만 골라내서 집계 연산을 한다.

             kor        eng       math       total        avg
count   5.000000   5.000000   5.000000    5.000000   5.000000
mean   76.000000  77.200000  75.000000  228.200000  76.066667
std    12.942179  10.568822   7.905694   29.852973   9.950991
min    60.000000  65.000000  65.000000  195.000000  65.000000
25%    70.000000  70.000000  70.000000  210.000000  70.000000
50%    75.000000  75.000000  75.000000  220.000000  73.333333
75%    80.000000  86.000000  80.000000  246.000000  82.000000
max    95.000000  90.000000  85.000000  270.000000  90.000000

In [22]:
# 평균에 대하여 국어점수의 상관 관계
print(df1['avg'].corr(df1['kor']))
print(df1['avg'].corr(df1['eng']))
df1.corr()

0.9796498791345076
0.9475112655846141

C:\Users\yang\AppData\Local\Temp\ipykernel_12524\2659783192.py:4: FutureWarning: The default value of numeric_only in DataFrame.corr is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  df1.corr()

            kor       eng      math     total       avg
kor    1.000000  0.902886  0.855186  0.979650  0.979650
eng    0.902886  1.000000  0.762981  0.947511  0.947511
math   0.855186  0.762981  1.000000  0.905688  0.905688
total  0.979650  0.947511  0.905688  1.000000  1.000000
avg    0.979650  0.947511  0.905688  1.000000  1.000000

In [23]:
# csv 파일 가져오기
df = pd.read_csv('data/movies.csv')
print(df.head()) #맨위 다섯개
print(df.tail()) #맨끝 다섯개

   movieId                               title  \
0        1                    Toy Story (1995)
1        2                      Jumanji (1995)
2        3             Grumpier Old Men (1995)
3        4            Waiting to Exhale (1995)
4        5  Father of the Bride Part II (1995)

                                        genres
0  Adventure|Animation|Children|Comedy|Fantasy
1                   Adventure|Children|Fantasy
2                               Comedy|Romance
3                         Comedy|Drama|Romance
4                                       Comedy
      movieId                                      title  \
9737   193581  Black Butler: Book of the Atlantic (2017)
9738   193583               No Game No Life: Zero (2017)
9739   193585                               Flint (2017)
9740   193587        Bungo Stray Dogs: Dead Apple (2018)
9741   193609        Andrew Dice Clay: Dice Rules (1991)

                               genres
9737  Action|Animation|Comedy|Fantasy
9738         Animation|Comedy|Fantasy
9739                            Drama
9740                 Action|Animation
9741                           Comedy

In [24]:
genr=[]
for i in data['genres'] :
    # genr.append(i.split("|"))
    genr.extend(i.split("|"))
    # print(i)
    # break
# genr
print(len(genr))
genr

KeyError: 'genres'

In [ ]:
unique_genr = pd.unique(genr)
print(len(unique_genr))
unique_genr

20

array(['Adventure', 'Animation', 'Children', 'Comedy', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Mystery', 'Sci-Fi', 'War', 'Musical', 'Documentary', 'IMAX',
       'Western', 'Film-Noir', '(no genres listed)'], dtype=object)

In [ ]:
zero_data = np.zeros(len(unique_genr))
# zero_data
result = pd.DataFrame(zero_data, index=unique_genr, columns=['count'])
result

                    count
Adventure             0.0
Animation             0.0
Children              0.0
Comedy                0.0
Fantasy               0.0
Romance               0.0
Drama                 0.0
Action                0.0
Crime                 0.0
Thriller              0.0
Horror                0.0
Mystery               0.0
Sci-Fi                0.0
War                   0.0
Musical               0.0
Documentary           0.0
IMAX                  0.0
Western               0.0
Film-Noir             0.0
(no genres listed)    0.0

In [ ]:
for i in genr :
    result.loc[i] += 1
result

                     count
Adventure           1263.0
Animation            611.0
Children             664.0
Comedy              3756.0
Fantasy              779.0
Romance             1596.0
Drama               4361.0
Action              1828.0
Crime               1199.0
Thriller            1894.0
Horror               978.0
Mystery              573.0
Sci-Fi               980.0
War                  382.0
Musical              334.0
Documentary          440.0
IMAX                 158.0
Western              167.0
Film-Noir             87.0
(no genres listed)    34.0

In [ ]:
input_file = 'data/input.csv'
output_file = 'data/output.csv'

df = pd.read_csv(input_file)

# df['Cost'] = df['Cost'].str.strip("$") #strip : 양쪽 가장자리에 $ 문자가 있으면 잘라줘라
df['Cost'] = df['Cost'].str.strip("$").str.replace(',', '').astype('float32')
# df.info()

df.loc[(df['Supplier Name'] == 'A') & (df['Cost'] >= 700000)]

  Supplier Name Invoice Number  Part Number      Cost Purchase Date
2             A       001-1001         5407  750000.0    2014-01-20
3             A       001-1001         2341  750000.0    2014-01-20

In [ ]:
# Supplier Name 별로 Coast의 평균을 구하자.
# df.groupby('Supplier Name').mean()
df.groupby('Supplier Name')['Cost'].mean()
df.groupby('Supplier Name')['Cost'].agg(['sum', 'mean'])

                     sum      mean
Supplier Name
A              2500000.0  625000.0
B               750000.0  187500.0
C              2460000.0  615000.0

Invoice Number  001-1001 그룹을 해서 Coat 평균, 합계
001-1001 : 001별로

In [ ]:
df['Invoice_i'] = df['Invoice Number'].apply(lambda a: a.split('-')[0])
df

   Supplier Name Invoice Number  Part Number      Cost Purchase Date Invoice_i
0              A       001-1001         2341  500000.0    2014-01-20       001
1              A       001-1001         5467  500000.0    2014-01-20       001
2              A       001-1001         5407  750000.0    2014-01-20       001
3              A       001-1001         2341  750000.0    2014-01-20       001
4              B        50-9501         7009  250000.0    2018-01-30        50
5              B        50-9501         7009  250000.0    2018-01-30        50
6              B        50-9505         6650  125000.0    2017-02-03        50
7              B        50-9505         6650  125000.0    2017-02-03        50
8              C       920-4803         3321  615000.0    2017-02-03       920
9              C       920-4804         3321  615000.0    2017-02-10       920
10             C       920-4805         3321  615000.0    2017-02-17       920
11             C       920-4806         3321  615000.0    2017-02-24       920

In [ ]:
df['Invoice_num'] = df['Invoice Number'].str.split('-')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Supplier Name   12 non-null     object
 1   Invoice Number  12 non-null     object
 2   Part Number     12 non-null     int64
 3   Cost            12 non-null     float32
 4   Purchase Date   12 non-null     object
 5   Invoice_i       12 non-null     object
 6   Invoice_num     12 non-null     object
dtypes: float32(1), int64(1), object(5)
memory usage: 756.0+ bytes